# 此文件展现了各种数据类型的基本使用方法。
# 整数：例如：1，100，-8080，0，等等。
# 浮点数： 例如1.23，3.14，-9.01等等
# 字符串：以单引号''或双引号""括起来的文本。
#         如果'本身也是字符，那就可以用""括起来。
#         也可以使用\来转义'和"等特殊符号。此外，Python中允许以'''文本行二
#         文本行二'''来进行换行。
#         r''表示''内部的字符串默认不转义。
# 布尔值: True 和 False。
#         运算方法 and、or和not。（即与、或、非）
# 空值: None
# 常量: 例如: PI = 3.1415926535
# 除法运算的精确性： 在Python中10 / 3 = 3.33333333333,结果为浮点数（即使恰好整除，结果也是浮点数）。
#                              10 // 3 = 3（地板除）,结果只取整数部分。
#                              10 % 3 = 1(取余数)，结果取余数部分。
# 练习：
# 请打印出以下变量的值
# n = 123
# f = 456.789
# s1 = 'Hello, world'
# s2 = 'Hello, \'Adam\''
# s3 = r'Hello, "Bart"'
# s4 = r'''Hello,
# Lisa!'''

print("""n = 123
f = 456.789
s1 = \'Hello, world\'
s2 = \'Hello, \\'Adam\\''
s3 = r\'Hello, \"Bart\"\'
s4 = r\'\'\'Hello,
Lisa!\'\'\'""")

